{
  "courses": [
    {
      "id": "1",
      "title": "آموزش Tailwind CSS - دوره فشرده",
      "price": "رایگان",
      "time": "۱ ساعت و ۵۰ دقیقه",
      "students": "406",
      "desc": "آموزش Tailwind CSS – دوره فشرده بر روی مفاهیم اصلی فریم‌ورک Tailwind CSS تمرکز دارد. Tailwind CSS ابزاری است که برای پیاده‌سازی استایل‌های CSS مورد استفاده قرار می‌گیرد. روش کار در Tailwind CSS به این صورت است که تیم توسعه این فریم‌ورک، کلاس‌هایی را از قبل توسعه داده و آن‌ها در اختیار توسعه‌دهنده قرار می‌دهند. ما می‌توانیم با فرا‌خوانی این کلاس‌ها، از آن‌ها در پروژه‌های خود استفاده کنیم. در نتیجه، استفاده از این فریم‌ورک‌ به ما کمک می‌کند تا هم بتوانیم پروژه‌ای که داریم را سریع‌تر اجرا کنیم و هم کارها را به شکل استاندارد پیش ببریم. Tailwind CSS در سال‌های اخیر رشد خیلی خوبی داشته و به یکی از محبوب‌ترین فریم‌ورک‌ها برای پیاده‌سازی استایل تبدیل شده است. زیرا، انعطاف‌پذیری و پرفورمنس بالایی دارد و استفاده از آن بسیار ساده می‌باشد. توسعه‌دهندگان فرانت‌اند باید بر روی ابزارهای مختلف از جمله Tailwind CSS تسلط کافی داشته باشند. از این رو، ما در فرانت کست تصمیم گرفتیم تا یک دوره فشرده و رایگان برای آموزش فریم‌ورک Tailwind CSS آماده کنیم. ما در دوره فشرده آموزش Tailwind CSS سعی کردیم که مفاهیم اصلی این فریم‌ورک را مرور کنیم. سپس در ادامه، مسئله‌ای را باهم حل می‌کنیم. درنهایت، به کمک انجام این مسئله می‌توانیم به تسلط کافی بر روی مفاهیم اصلی فریم‌ورک Tailwind CSS دست پیدا کنیم.",
      "image": "https://frontcast.ir/wp-content/uploads/2024/11/tailwind-css-600_400-1x-1.png"
    },
    {
      "id": "2",
      "title": "آموزش Redux Toolkit - دوره فشرده",
      "price": "رایگان",
      "time": "۱ ساعت و ۱۱ دقیقه",
      "students": "303",
      "desc": "آموزش Redux Toolkit – دوره فشرده بر روی مفاهیم اصلی Redux Toolkit تمرکز دارد. هنگامی که برنامه ما گسترده‌تر می‌شود لازم است داده‌هایی را در قسمت‌های مختلف برنامه به اشتراک بگذاریم. زمانی که این داده‌ها ساختار پیچیده‌تری داشته باشند، به یک معماری نیاز داریم تا بتوانیم State برنامه‌ای که داریم را منطقی‌تر مدیریت کنیم. روش‌های مختلفی برای انجام این کار وجود دارد. به عنوان مثال می‌توانیم از Context استفاده کنیم که در دوره آموزش React – مقدماتی تا پیشرفته به شکل کامل به آن پرداخته‌ایم. اما یکی از روش‌های بسیار مرسومی که برای انجام این کار وجود دارد استفاده از کتابخانه Redux می‌باشد. Redux Toolkit ابزار رسمی تیم Redux است که طبق پیشنهاد آن‌ها، بهتر است در پروژه‌های خود از Redux Toollkit استفاده کنیم. ما در دوره آموزش Redux Toolkit سعی کرده‌ایم مفاهیم مربوط به Redux Toolkit را بسیار ساده و دقیق بررسی کنیم تا در نهایت، پس از تکمیل دوره بتوانیم به درک درستی از آن برسیم و در پروژه‌های خود از Redux Toolkit استفاده کنیم. نکته مهمی که در مورد دوره آموزش Redux Toolkit وجود دارد این است که مفاهیم را با تایپ اسکریپت پیش می‌بریم. دانش تایپ اسکریپت برای توسعه‌دهندگان جاوااسکریپت در حال حاضر یک باید است و کمک می‌کند تا بتوانیم اجزای Redux Toolkit را بهتر درک کنیم. پیش‌نیاز اصلی برای دوره آموزش Redux Toolkit، درک درست از مفاهیم React است.",
      "image": "https://frontcast.ir/wp-content/uploads/2024/09/redux-cover-1.png"
    },
    {
      "id": "3",
      "title": "آموزش React - مقدماتی تا پیشرفته",
      "price": "1,400,000",
      "time": "۷ ساعت و ۴۵ دقیقه",
      "students": "305",
      "desc": "React محبوب‌ترین کتابخانه جاوااسکریپت است که از آن برای توسعه قسمت رابط کاربری استفاده می‌شود. همین موضوع باعث شده است تا بسیاری از شرکت‌ها و استارت‌آپ‌ها برای توسعه محصولات خود از React استفاده کنند. به دلیل متن باز بودن، پشتیبانی جامعه و مستندات قوی دارد. تایپ اسکریپت نیز در این دوره آموزش داده می‌شود، چرا که توسعه اپلیکیشن‌های پیچیده با جاوااسکریپت می‌تواند دشوار باشد. دوره از پایه‌ترین مفاهیم شروع می‌شود و با آموزش دقیق و گام‌به‌گام به سطح پیشرفته می‌رسد. پیش‌نیاز این دوره آشنایی با HTML، CSS و تسلط بر جاوااسکریپت است.",
      "image": "https://frontcast.ir/wp-content/uploads/2024/07/react-ts-cover.png"
    },
    {
      "id": "4",
      "title": "آموزش Next.js - دوره جامع",
      "price": "1,200,000",
      "time": "۱۵ ساعت و ۱۰ دقیقه",
      "students": "719",
      "desc": "Next.js یک فریم‌ورک مبتنی بر React است که قابلیت‌هایی مانند SSR، API داخلی و بهینه‌سازی سئو را ارائه می‌دهد. این فریم‌ورک برای توسعه برنامه‌های وب با مقیاس بزرگ مناسب است. دوره آموزش Next.js از مفاهیم پایه شروع شده و به‌صورت پروژه‌محور و منتور محور ادامه پیدا می‌کند. پیش‌نیاز این دوره آشنایی با React و جاوااسکریپت است.",
      "image": "https://frontcast.ir/wp-content/uploads/2022/09/nextjs.jpg"
    },
    {
      "id": "5",
      "title": "آموزش جاوااسکریپت - مفاهیم پیشرفته",
      "price": "رایگان",
      "time": "۱ ساعت و ۴۰ دقیقه",
      "students": "1741",
      "desc": "این دوره به بررسی عمیق مفاهیم پیشرفته جاوااسکریپت می‌پردازد که در پروژه‌های بزرگ و مصاحبه‌های استخدامی بسیار مهم هستند. اگر با جاوااسکریپت آشنا هستید و می‌خواهید سطح خود را ارتقا دهید، این دوره برای شما مناسب است. تمرکز بر حل مسائل و درک مفاهیم پیچیده جاوااسکریپت است.",
      "image": "https://frontcast.ir/wp-content/uploads/2022/06/js-advanced-concepts.jpg"
    },
    {
      "id": "6",
      "title": "آموزش TypeScript - دوره جامع",
      "price": "1,100,000",
      "time": "۶ ساعت و ۱۰ دقیقه",
      "students": "627",
      "desc": "TypeScript زبان توسعه‌یافته مایکروسافت برای جلوگیری از خطاهای رایج در جاوااسکریپت است. این دوره جامع از پایه‌ترین مفاهیم شروع شده و تا مباحث پیشرفته ادامه دارد. آموزش‌ها پروژه‌محور، همراه با تمرین و پشتیبانی مدرس هستند. همچنین به‌روزرسانی‌های رسمی TypeScript نیز در دوره لحاظ می‌شوند.",
      "image": "https://frontcast.ir/wp-content/uploads/2022/03/typescript.jpg"
    },
    {
      "id": "7",
      "title": "آموزش React - دوره فشرده",
      "price": "رایگان",
      "time": "۲ ساعت و ۲۰ دقیقه",
      "students": "2416",
      "desc": "دوره فشرده React مناسب افراد مبتدی و کسانی است که می‌خواهند به‌سرعت مفاهیم اصلی این کتابخانه را مرور کنند. این دوره طبق آخرین به‌روزرسانی‌ها طراحی شده و از مفاهیم ابتدایی تا پیشرفته را شامل می‌شود. مسیر یادگیری در آن گام‌به‌گام و کاملاً کاربردی است.",
      "image": "https://frontcast.ir/wp-content/uploads/2022/02/react.jpg"
    },
    {
      "id": "8",
      "title": "ساختمان داده و الگوریتم ها در جاوااسکریپت",
      "price": "850,000",
      "time": " ۵ ساعت و ۱۰ دقیقه",
      "students": "824",
      "desc": "دوره ساختمان داده و الگوریتم‌ها به بررسی مفاهیم مهم علوم کامپیوتر مانند انواع ساختار داده و روش‌های حل مسئله می‌پردازد. این دوره پروژه‌محور، چالش‌محور و از پایه تا پیشرفته طراحی شده است. یادگیری این مفاهیم برای موفقیت در مصاحبه‌های شغلی و توسعه نرم‌افزارهای سطح بالا ضروری است.",
      "image": "https://frontcast.ir/wp-content/uploads/2020/10/data-structures-and-algorithms.jpg"
    }
  ]
}